---
kind: property
id: P:Autodesk.Revit.DB.MultiReferenceAnnotation.DimensionId
source: html/99cb3709-901d-d73d-4e0d-4c75d3e0237e.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotation.DimensionId Property

The child dimension owned by this multi-reference annotation.

## Syntax (C#)
```csharp
public ElementId DimensionId { get; }
```